In [17]:
import pandas as pd
my_dict = {"a":[1,2,3],"b":[2,None,3],"c":[9,None,None]}
df = pd.DataFrame(my_dict)
df

   a    b    c
0  1  2.0  9.0
1  2  NaN  NaN
2  3  3.0  NaN

In [18]:
df.dropna(axis = 0)

   a    b    c
0  1  2.0  9.0

In [19]:
df.dropna(axis = 1)

   a
0  1
1  2
2  3

In [21]:
df.dropna(axis = 0,thresh = 2)

   a    b    c
0  1  2.0  9.0
2  3  3.0  NaN

In [22]:
df.fillna(value = "python")

   a       b       c
0  1     2.0     9.0
1  2  python  python
2  3     3.0  python

In [24]:
df["b"].fillna(df["b"].mean())

0    2.0
1    2.5
2    3.0
Name: b, dtype: float64